Show / Hide Table of Contents
Class OpenModelContainer
OpenModelContainer is used to keep structural data and results of a finite element analysis in one place. The main reason is easier moving (passing) pass the instance of OpenModel and corresponding instace of OpenModelResults.
Inheritance
System.Object
OpenModelContainer
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel
Assembly: IdeaRS.OpenModel.dll
Syntax
public class OpenModelContainer
Properties
Improve this Doc   View Source
OpenModel
Open Model - structural data
Declaration
public OpenModel OpenModel { get; set; }
Property Value
 Type |  Description
 OpenModel
Improve this Doc   View Source
OpenModelResult
Open Model Result - results of a finite element analysis
Declaration
public OpenModelResult OpenModelResult { get; set; }
Property Value
 Type |  Description
 OpenModelResult
 Improve this Doc
 View Source